In [2]:
import pandas as pd 
import geopandas as gpd
import numpy as np

In [4]:
df=pd.read_csv('../csvs/data_NY_1945_final.csv')
df.head()

,Name,Birth Year,Arrival Date,Departure Port,Ethnicity/Nationality,Ship Name
0,Willy Boyer,abt 1904,29 Mar 1934,West Indies,Polish,Reliance
1,Arthur J M Perry,abt 1911,18 Aug 1945,"Corpus Christi, Texas",English,Tidewater
2,Thomas Murray,abt 1907,18 Aug 1945,"Corpus Christi, Texas",Irish,Tidewater
3,Svend A Hansen,abt 1899,18 Aug 1945,"Corpus Christi, Texas",Danish,Tidewater
4,Douglas H Fristbrook,abt 1907,18 Aug 1945,"Corpus Christi, Texas",American,Tidewater

In [10]:
df_group=df[['Name','Arrival Date','Departure Port','Ship Name']].groupby([
    'Arrival Date','Departure Port','Ship Name']).count().reset_index()
df_group=df_group.rename(columns={"Name": "counts"})
df_group

   Arrival Date         Departure Port         Ship Name  counts
0    1 Jan 1945      Glasgow, Scotland   Abigail Gibbons       5
1    1 Jan 1945  Jacksonville, Florida  Arthur M Huddell       6
2    1 Jan 1945     Liverpool, England   Abigail Gibbons      30
3    1 Jan 1945     Liverpool, England           Amastra      68
4    1 Jan 1945     Liverpool, England  Arthur M Huddell      76
5    1 Jan 1945     Liverpool, England       Pan America     101
6    1 Jan 1945        London, England  Arthur M Huddell      14
7    1 Jan 1945     New York, New York          Arizonan      64
8    1 Jan 1945         Newport, Wales          Arizonan      44
9   18 Aug 1945  Corpus Christi, Texas         Tidewater      23
10  29 Mar 1934            West Indies          Reliance       1
11     Jan 1945      Savannah, Georgia   Abigail Gibbons      12

In [60]:
dep_port=df['Departure Port'].unique()
#remove nan
dep_port_clean = [x for x in dep_port if str(x) != 'nan']
dep_port_clean

['West Indies',
 'Corpus Christi, Texas',
 'Liverpool, England',
 'Glasgow, Scotland',
 'Savannah, Georgia',
 'New York, New York',
 'Newport, Wales',
 'Jacksonville, Florida',
 'London, England']

In [14]:
pip install geopy

Collecting geopy
  Downloading geopy-2.3.0-py3-none-any.whl (119 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 119.8/119.8 kB 1.7 MB/s eta 0:00:00a 0:00:01
Collecting geographiclib<3,>=1.52
  Downloading geographiclib-2.0-py3-none-any.whl (40 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 40.3/40.3 kB 1.2 MB/s eta 0:00:00
Installing collected packages: geographiclib, geopy
Successfully installed geographiclib-2.0 geopy-2.3.0
Note: you may need to restart the kernel to use updated packages.

In [15]:
from geopy.geocoders import GoogleV3

In [44]:
geolocator = GoogleV3(api_key='AIzaSyCYQ6IUl0eoKRe1gB2L0-y5ptSYdxDhro0')
address=['Jacksonville, Florida']
location = geolocator.geocode(address)

# Print the latitude and longitude of the location
print((location.latitude, location.longitude))
location

(30.3321838, -81.65565099999999)

Location(Jacksonville, FL, USA, (30.3321838, -81.65565099999999, 0.0))

In [68]:
geolocator = GoogleV3(api_key='AIzaSyCYQ6IUl0eoKRe1gB2L0-y5ptSYdxDhro0')
name=[]
latitude=[]
longitude=[]
for address_each in dep_port_clean:
    location_each = geolocator.geocode(address_each)
    name.append(address_each)
    latitude.append(location_each.latitude)
    longitude.append(location_each.longitude)
print(name)

['West Indies', 'Corpus Christi, Texas', 'Liverpool, England', 'Glasgow, Scotland', 'Savannah, Georgia', 'New York, New York', 'Newport, Wales', 'Jacksonville, Florida', 'London, England']

In [69]:
geo_dep_port= pd.DataFrame({'name' : name, 'latitude' : latitude,'longitude' : longitude })
geo_dep_port

                    name   latitude  longitude
0            West Indies  18.234503 -66.410848
1  Corpus Christi, Texas  27.800583 -97.396381
2     Liverpool, England  53.408371  -2.991573
3      Glasgow, Scotland  55.864237  -4.251806
4      Savannah, Georgia  32.080899 -81.091203
5     New York, New York  40.712775 -74.005973
6         Newport, Wales  51.584151  -2.997664
7  Jacksonville, Florida  30.332184 -81.655651
8        London, England  51.507218  -0.127586